Revit 2024 API
IFCOpeningData.IsRecess Property
 Trus if it is a recess, false if it is an opening.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsRecess { get; }
Visual Basic
Public ReadOnly Property IsRecess As Boolean
	Get
Visual C++
public:
property bool IsRecess {
	bool get ();
}
See Also
IFCOpeningData Class
Autodesk.Revit.DB.IFC Namespace